Revit 2027 API
ComboBoxMemberData.Text Property
The user-visible text of the ComboBoxMember.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Text { get; set; }
Public Property Text As String
	Get
	Set
public:
property String^ Text {
	String^ get ();
	void set (String^ value);
}
member Text : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException | Thrown when setting the value to null.
ArgumentException | Thrown when setting the value to an empty string, or when the value contains invalid characters.
See Also
Reference
ComboBoxMemberData Class
Autodesk.Revit.UI Namespace